#1)将中国所有省会城市添加到上述列表中
# a = ["北京", "上海", "广东"]
# b = ["天津", "重庆", "哈尔滨", "银川", "郑州", "济南", "太原", "合肥", "长春", "沈阳", "呼和浩特", "石家庄", "乌鲁木齐", "兰州", "西宁", "西安", "长沙", "武汉",
#      "南京", "成都", "贵阳", "昆明", "南宁", "拉萨", "杭州", "南昌", "广州", "福州", "台北", "海口", "香港", "澳门"]
# i = 0
# c = []
# while True:
#     if i < 32:
#         c = b.pop()
#         a.append(c)
#         i += 1
#     else:
#         break
# print(a)

#广东成为第二大发达城市，将广东排在上海前面
# a = ["北京", "上海", "广东"]
# a.remove("广东")
# a.insert(1,"广东")
# print(a)


# 3)[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
# 这是中国GDP排名前8的城市的GDP数值，请统计前8城市的GDP总和，平均GDP。
# a = [36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
# sum1 = sum(a)
# avg = sum1 / len(a)
# print("GDp总和为：",sum1)
# print("平均GDp为：",avg)

#求其中是5的倍数的和
# a = [1,5,21,30,15,9,30,24]
# i = 0
# sum = 0
# while i < 8:
#     if a[i] % 5 == 0:
#         sum += a[i]
#     i += 1
# print(sum)

#List = [1,2,3,4,5,6,7,8,9]
#实现效果：list = [9,8,7,6,5,4,3,2,1]

# List = [1,2,3,4,5,6,7,8,9]
# list = []
# a = []
# i = 0
# while 1:
#     if i < 9:
#         a = List.pop()
#         list.append(a)
#         i +=1
#     else:
#         break
# print("list=",list)


#编程统计列表中的每个数字出现的次数
# List = [1,4,7,5,8,2,1,3,4,5,9,7,6,1,10]
# i = 1
# while i <=10:
#     print(i,"相同的次数：",List.count(i))
#     i += 1


